#+TITLE:     mylittlepwny
#+AUTHOR:    Damien Couroussé -- CEA
#+EMAIL:     damien.courousse@cea.fr
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:t toc:2 \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+OPTIONS:   email:t
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:
#+LINK_HOME:
#+startup: beamer
#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [8pt]

# export pdf: C-c C-e l O   //   org-beamer-export-to-pdf

#+ATTR_LATEX: :options basicstyle=\ttfamily\scriptsize

*** Overview of program options

#+BEGIN_SRC shell :exports both :results output
stack exec cpa-hyps -- --help
#+END_SRC

#+results:
#+begin_example
cpa-hyps: compute hypothesis values for CPA attacks on AES.

Usage: cpa-hyps [-o|--output FILE] [-n|--nb NUMBER] [-x|--seed SEED_VALUE]
                COMMAND
  cpa-hyps: a few bunch of things to perform side channel attacks. Use COMMAND
  --help to see the list of options supported by each command.

Available options:
  -h,--help                Show this help text
  -o,--output FILE         Name of the output file (default: "output.txt")
  -n,--nb NUMBER           Size of the set of plaintexts
                           generated (default: 16384)
  -x,--seed SEED_VALUE     Seed of the random number generator (default: 0)

Available commands:
  version                  Print program version
  plaintexts               Generate a list of random plaintexts
  addrk                    Compute hypothesis values for the first AddRoundKey,
                           using a Hamming weight model.
  sbox                     Compute hypothesis values for the first SBOX, using a
                           Hamming weight model.
  ttest-fr                 Compute two populations of plaintexts for the
                           non-specific t-test (fixed vs. random), for the
                           output of the first SBOX. Generates two plaintext
                           files named after the contents of options
                           --population0 and --population1.
  ttest-rr                 Compute two populations of plaintexts for the
                           specific t-test (random vs. random), for the output
                           of the first SBOX. Generates a list of plaintexts and
                           a list of values {0,1} to separate the two t-test
                           populations.
#+end_example

(org-babel-get-header)

*** command =plaintexts=

Use this command to generate a list of random plaintexts.  This
command has no specific option.

#+BEGIN_SRC shell :exports both :results output
stack exec cpa-hyps -- plaintexts --help
#+END_SRC

#+results:
: Usage: cpa-hyps plaintexts
:   Generate a list of random plaintexts
:
: Available options:
:   -h,--help                Show this help text

*** command =sbox=

Use this command to generate the CPA correlation hypothesis at the
output of the first SubBytes computation in AES.  Currently we use the
Hamming Weight to compute the power model.

#+BEGIN_SRC shell :exports both :results output
stack exec cpa-hyps -- sbox --help
#+END_SRC

#+results:
: Usage: cpa-hyps sbox (-p|--plaintexts ARG) [-b|--byte ARG]
:   Compute hypothesis values for the first SBOX, using a Hamming weight model.
:
: Available options:
:   -p,--plaintexts ARG      Name of the input file containing the plaintext
:                            values
:   -b,--byte ARG            Byte number in [0..15] used to compute CPA
:                            correlation hypothesis (default: 0)
:   -h,--help                Show this help text

*** command =ttest-fr=

Provides two input plaintext populations to perform a specific fixed vs. random
t-test.

#+BEGIN_SRC shell :exports both :results output
stack exec cpa-hyps -- ttest-fr --help
#+END_SRC

#+results:
#+begin_example
Usage: cpa-hyps ttest-fr [-p|--plaintexts ARG] [-s|--separate ARG]
  Compute two populations of plaintexts for the non-specific t-test (fixed vs.
  random), for the output of the first SBOX. Generates two plaintext files named
  after the contents of options --population0 and --population1.

Available options:
  -p,--plaintexts ARG      Name of the output file containing the plaintext
                           values for the two
                           populations. (default: "plaintexts.txt")
  -s,--separate ARG        This generated files has the same length than the
                           plaintext file. It contains a list of integer values
                           either 0 or 1, in order to separate the plaintexts
                           between two populations '0' and
                           '1'. (default: "text-separate.txt")
  -h,--help                Show this help text
#+end_example

*** command =ttest=rr=

Provides two input plaintext populations to perform a specific random vs. random
t-test.

#+BEGIN_SRC shell :exports both :results output
stack exec cpa-hyps -- ttest-rr --help
#+END_SRC

#+results:
#+begin_example
Usage: cpa-hyps ttest-rr (-k|--key KEYFILE) [-b|--bit-number BIT_NUMBER]
                         [-p|--plaintexts ARG] [-s|--separate ARG]
                         [-c|--ciphers CIPHERS]
  Compute two populations of plaintexts for the specific t-test (random vs.
  random), for the output of the first SBOX. Generates a list of plaintexts and
  a list of values {0,1} to separate the two t-test populations.

Available options:
  -k,--key KEYFILE         the input key file
  -b,--bit-number BIT_NUMBER
                           number of the state bit observed (default: 0)
  -p,--plaintexts ARG      Name of the output file containing the plaintext
                           values for the two
                           populations. (default: "plaintexts.txt")
  -s,--separate ARG        This generated files has the same length than the
                           plaintext file. It contains a list of integer values
                           either 0 or 1, in order to separate the plaintexts
                           between two populations '0' and
                           '1'. (default: "text-separate.txt")
  -c,--ciphers CIPHERS     Generate the lists of expected cipher values in file
                           CIPHERS. The file is not generated if this option is
                           not used.
  -h,--help                Show this help text
#+end_example
